content/posts/Optimal_Renormalization_Group_Transformation_from_Information_Theory_by_Lenggenhager,_Ringel,_Huber,_and_Koch-Janusz_in_2018.md
+++
title = "Optimal Renormalization Group Transformation from Information Theory by Lenggenhager, Ringel, Huber, and Koch-Janusz in 2018"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:32-04:00
slug = "Optimal_Renormalization_Group_Transformation_from_Information_Theory_by_Lenggenhager,_Ringel,_Huber,_and_Koch-Janusz_in_2018"
draft = false
+++

## I. Introduction {#i-dot-introduction}


## II. The RSMI algorithm {#ii-dot-the-rsmi-algorithm}


## III. Optimality: the measure and the effective Hamiltonian {#iii-dot-optimality-the-measure-and-the-effective-hamiltonian}


## IV. The cumulant expansion {#iv-dot-the-cumulant-expansion}


## V. Example: The 1D Ising model {#v-dot-example-the-1d-ising-model}


## VI. The "shape" of the coarse-grained variables {#vi-dot-the-shape-of-the-coarse-grained-variables}


## VII. Conclusions and outlook {#vii-dot-conclusions-and-outlook}


## Appendix A: Mutual information {#appendix-a-mutual-information}


## Appendix B: RSMI does not increase rangeness {#appendix-b-rsmi-does-not-increase-rangeness}


## Appendix C: The effective Hamiltonian {#appendix-c-the-effective-hamiltonian}


### 1. Factorization of quenched averages {#1-dot-factorization-of-quenched-averages}


### 2. Parametrization of the RG rule using RBM ansatz {#2-dot-parametrization-of-the-rg-rule-using-rbm-ansatz}


## Appendix D: The 1D Ising model {#appendix-d-the-1d-ising-model}


### 1. Exact decimation {#1-dot-exact-decimation}


### 2. The effective Hamiltonian {#2-dot-the-effective-hamiltonian}


### 3. The case of \\[L\_{\Nu} = 2\\] blocks: discussion of the numerical results {#3-dot-the-case-of-l-nu-2-blocks-discussion-of-the-numerical-results}


### 4. Mutual Information {#4-dot-mutual-information}


### 5. The case of larger blocks {#5-dot-the-case-of-larger-blocks}


## Appendix E: Toy models {#appendix-e-toy-models}


### 1. 1D system {#1-dot-1d-system}


### 2. 2D system {#2-dot-2d-system}
